Pandas Tutorial
Generally Two types 
One is for Series and another one is dataframe

In [1]:
##Create Series and Dataframe
import pandas as pd
import numpy as np
from pandas import Series , DataFrame

In [2]:
obj=Series([3,4,5,3])

In [3]:
obj

0    3
1    4
2    5
3    3
dtype: int64

In [4]:
obj.values

array([3, 4, 5, 3])

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
##Creating a Series with a named index
coins=Series([0.1,0.4,0.5,0.7],index=['index_one','index_two','index_three','index_four'])
coins
coins['index_one']

0.1

In [9]:
###DataFrames
##Every dataframe works on numeric data so we have to change numeric first before using it
coins[coins>=0.7]

index_four    0.7
dtype: float64

In [17]:
###Reading 
##set commonly used directions as raw data strings in the code
import os ### os module provies a way of using operating system
import pandas as pd
file1=pd.read_excel('foo.xlsx')
file1

   Unnamed: 0  id raw_grade grade
0           0   1         a     a
1           1   2         b     b
2           2   3         b     b
3           3   4         a     a
4           4   5         a     a
5           5   6         b     b

In [18]:
file1.values

array([[0, 1, 'a', 'a'],
       [1, 2, 'b', 'b'],
       [2, 3, 'b', 'b'],
       [3, 4, 'a', 'a'],
       [4, 5, 'a', 'a'],
       [5, 6, 'b', 'b']], dtype=object)

In [21]:
file1.shape

(6, 4)

In [22]:
file1.columns

Index(['Unnamed: 0', 'id', 'raw_grade', 'grade'], dtype='object')

In [23]:
file1.describe()

       Unnamed: 0        id
count    6.000000  6.000000
mean     2.500000  3.500000
std      1.870829  1.870829
min      0.000000  1.000000
25%      1.250000  2.250000
50%      2.500000  3.500000
75%      3.750000  4.750000
max      5.000000  6.000000

Missing Value

In [24]:
data=Series(['one','two',np.nan,'three'])
data

0      one
1      two
2      NaN
3    three
dtype: object

In [25]:
data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [26]:
###In a dataframe 
dframe=DataFrame([[1,2,3],[2,np.nan,3],[3,np.nan,9]])
dframe

   0    1  2
0  1  2.0  3
1  2  NaN  3
2  3  NaN  9

In [27]:
dframe.isnull()

       0      1      2
0  False  False  False
1  False   True  False
2  False   True  False

In [29]:
clean_dframe=dframe.dropna()
clean_dframe

   0    1  2
0  1  2.0  3

In [32]:
dframe.dropna(how='all')

   0    1  2
0  1  2.0  3

In [31]:
dframe.dropna(axis=1) ###specify drop column (one) which has nan value

   0  2
0  1  3
1  2  3
2  3  9

In [33]:
##We can also threshold that has missing data as well

dframe2=DataFrame([[1,2,3,np.nan],[np.nan,3,4,5],[5,np.nan,6,7]])
dframe2

     0    1  2    3
0  1.0  2.0  3  NaN
1  NaN  3.0  4  5.0
2  5.0  NaN  6  7.0

In [35]:
dframe2.dropna(thresh=2)

     0    1  2    3
0  1.0  2.0  3  NaN
1  NaN  3.0  4  5.0
2  5.0  NaN  6  7.0

In [40]:
dframe2.fillna(0,inplace=True)
dframe2

     0    1  2    3
0  1.0  2.0  3  0.0
1  0.0  3.0  4  5.0
2  5.0  0.0  6  7.0

Groupby

In [44]:
dframe =DataFrame({'X1':['X','X','X','X'],
                  'X2':['Y1','Y2','Y3','Y4'],
                  'dataset':np.random.rand(4),
                  'dataset1':np.random.randn(4)})
dframe

  X1  X2   dataset  dataset1
0  X  Y1  0.387670 -0.706794
1  X  Y2  0.552511  0.985035
2  X  Y3  0.936962  0.148683
3  X  Y4  0.879271 -1.157771

In [45]:
###Reshape 
##To convert rows to columns (used stack() method)
dframe.stack()

0  X1                 X
   X2                Y1
   dataset      0.38767
   dataset1   -0.706794
1  X1                 X
   X2                Y2
   dataset     0.552511
   dataset1    0.985035
2  X1                 X
   X2                Y3
   dataset     0.936962
   dataset1    0.148683
3  X1                 X
   X2                Y4
   dataset     0.879271
   dataset1    -1.15777
dtype: object

In [46]:
dframe.unstack()

X1        0           X
          1           X
          2           X
          3           X
X2        0          Y1
          1          Y2
          2          Y3
          3          Y4
dataset   0     0.38767
          1    0.552511
          2    0.936962
          3    0.879271
dataset1  0   -0.706794
          1    0.985035
          2    0.148683
          3    -1.15777
dtype: object